In [1]:
# Importing the libraries for data cleaning use to clean this data
import pandas as pd
import numpy as np
data = {
    'Company': ['ABC Corp', 'XYZ Inc', 'PQR Ltd', '123 Corp', None, 'ABC Corp', 'LMN Inc'],
    'Revenue ($M)': [100, 200, np.nan, 150, 100, 200, 300],
    'Profit Margin (%)': [10, -5, None, 8, 20, 5, 25],
    'Industry': ['Banking', 'Insurance', 'Banking', 'Investment', 'Insurance', np.nan, 'Banking'],
    'CEO': ['John Doe', 'Jane Smith', 'Alan Brown', 'Mark Lee', None, 'John Doe', 'Sarah Davis'],
    'Employees': [500, None, 120, 450, 700, 500, np.nan],
    'Stock Price': [50.5, None, 40.0, np.nan, 25.0, 50.5, 60.0],
    'HQ City': ['New York', 'London', None, 'Toronto', 'Paris', 'New York', 'New York'],
    'Founded Year': [1990, 1985, 2000, np.nan, 1995, 1990, None],
    'Market Cap ($B)': [2.5, 5.0, 1.2, 3.0, 1.5, None, 4.0],
    'Ticker Symbol': ['ABC', 'XYZ', None, '123', 'INS', 'ABC', 'LMN'],
    'Debt ($M)': [500, None, 300, np.nan, 200, 500, None]
}
# Converting the data into Data Frame
df = pd.DataFrame(data)
df

,Company,Revenue ($M),Profit Margin (%),Industry,CEO,Employees,Stock Price,HQ City,Founded Year,Market Cap ($B),Ticker Symbol,Debt ($M)
0,ABC Corp,100.0,10.0,Banking,John Doe,500.0,50.5,New York,1990.0,2.5,ABC,500.0
1,XYZ Inc,200.0,-5.0,Insurance,Jane Smith,NaN,NaN,London,1985.0,5.0,XYZ,NaN
2,PQR Ltd,NaN,NaN,Banking,Alan Brown,120.0,40.0,None,2000.0,1.2,None,300.0
3,123 Corp,150.0,8.0,Investment,Mark Lee,450.0,NaN,Toronto,NaN,3.0,123,NaN
4,None,100.0,20.0,Insurance,None,700.0,25.0,Paris,1995.0,1.5,INS,200.0
5,ABC Corp,200.0,5.0,NaN,John Doe,500.0,50.5,New York,1990.0,NaN,ABC,500.0
6,LMN Inc,300.0,25.0,Banking,Sarah Davis,NaN,60.0,New York,NaN,4.0,LMN,NaN

In [2]:
#Making the copy of the data 
fd = df.copy()
fd

,Company,Revenue ($M),Profit Margin (%),Industry,CEO,Employees,Stock Price,HQ City,Founded Year,Market Cap ($B),Ticker Symbol,Debt ($M)
0,ABC Corp,100.0,10.0,Banking,John Doe,500.0,50.5,New York,1990.0,2.5,ABC,500.0
1,XYZ Inc,200.0,-5.0,Insurance,Jane Smith,NaN,NaN,London,1985.0,5.0,XYZ,NaN
2,PQR Ltd,NaN,NaN,Banking,Alan Brown,120.0,40.0,None,2000.0,1.2,None,300.0
3,123 Corp,150.0,8.0,Investment,Mark Lee,450.0,NaN,Toronto,NaN,3.0,123,NaN
4,None,100.0,20.0,Insurance,None,700.0,25.0,Paris,1995.0,1.5,INS,200.0
5,ABC Corp,200.0,5.0,NaN,John Doe,500.0,50.5,New York,1990.0,NaN,ABC,500.0
6,LMN Inc,300.0,25.0,Banking,Sarah Davis,NaN,60.0,New York,NaN,4.0,LMN,NaN

In [3]:
fd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Company            6 non-null      object
 1   Revenue ($M)       6 non-null      float64
 2   Profit Margin (%)  6 non-null      float64
 3   Industry           6 non-null      object
 4   CEO                6 non-null      object
 5   Employees          5 non-null      float64
 6   Stock Price        5 non-null      float64
 7   HQ City            6 non-null      object
 8   Founded Year       5 non-null      float64
 9   Market Cap ($B)    6 non-null      float64
 10  Ticker Symbol      6 non-null      object
 11  Debt ($M)          4 non-null      float64
dtypes: float64(7), object(5)
memory usage: 804.0+ bytes

### Company Column Cleaning

In [4]:
# Checking the Duplicates in the data of company column
fd['Company'].duplicated().sum()

np.int64(1)

In [5]:
# Seeing the which are the duplicates
duplicates = fd[fd['Company'].duplicated(keep = False)]
duplicates

,Company,Revenue ($M),Profit Margin (%),Industry,CEO,Employees,Stock Price,HQ City,Founded Year,Market Cap ($B),Ticker Symbol,Debt ($M)
0,ABC Corp,100.0,10.0,Banking,John Doe,500.0,50.5,New York,1990.0,2.5,ABC,500.0
5,ABC Corp,200.0,5.0,NaN,John Doe,500.0,50.5,New York,1990.0,NaN,ABC,500.0

In [6]:
# Changing or removing the duplicate at the index 5 of the Compnay Column
fd.loc[5,'Company'] = "TechCorp"
fd

,Company,Revenue ($M),Profit Margin (%),Industry,CEO,Employees,Stock Price,HQ City,Founded Year,Market Cap ($B),Ticker Symbol,Debt ($M)
0,ABC Corp,100.0,10.0,Banking,John Doe,500.0,50.5,New York,1990.0,2.5,ABC,500.0
1,XYZ Inc,200.0,-5.0,Insurance,Jane Smith,NaN,NaN,London,1985.0,5.0,XYZ,NaN
2,PQR Ltd,NaN,NaN,Banking,Alan Brown,120.0,40.0,None,2000.0,1.2,None,300.0
3,123 Corp,150.0,8.0,Investment,Mark Lee,450.0,NaN,Toronto,NaN,3.0,123,NaN
4,None,100.0,20.0,Insurance,None,700.0,25.0,Paris,1995.0,1.5,INS,200.0
5,TechCorp,200.0,5.0,NaN,John Doe,500.0,50.5,New York,1990.0,NaN,ABC,500.0
6,LMN Inc,300.0,25.0,Banking,Sarah Davis,NaN,60.0,New York,NaN,4.0,LMN,NaN

In [7]:
fd

,Company,Revenue ($M),Profit Margin (%),Industry,CEO,Employees,Stock Price,HQ City,Founded Year,Market Cap ($B),Ticker Symbol,Debt ($M)
0,ABC Corp,100.0,10.0,Banking,John Doe,500.0,50.5,New York,1990.0,2.5,ABC,500.0
1,XYZ Inc,200.0,-5.0,Insurance,Jane Smith,NaN,NaN,London,1985.0,5.0,XYZ,NaN
2,PQR Ltd,NaN,NaN,Banking,Alan Brown,120.0,40.0,None,2000.0,1.2,None,300.0
3,123 Corp,150.0,8.0,Investment,Mark Lee,450.0,NaN,Toronto,NaN,3.0,123,NaN
4,None,100.0,20.0,Insurance,None,700.0,25.0,Paris,1995.0,1.5,INS,200.0
5,TechCorp,200.0,5.0,NaN,John Doe,500.0,50.5,New York,1990.0,NaN,ABC,500.0
6,LMN Inc,300.0,25.0,Banking,Sarah Davis,NaN,60.0,New York,NaN,4.0,LMN,NaN

In [8]:
fd["Company"].unique() #

array(['ABC Corp', 'XYZ Inc', 'PQR Ltd', '123 Corp', None, 'TechCorp',
       'LMN Inc'], dtype=object)

In [9]:
# filling the missing company name in the Compnay Column
fd['Company'] = fd['Company'].fillna("Shayan Enterprises")

In [10]:
fd

,Company,Revenue ($M),Profit Margin (%),Industry,CEO,Employees,Stock Price,HQ City,Founded Year,Market Cap ($B),Ticker Symbol,Debt ($M)
0,ABC Corp,100.0,10.0,Banking,John Doe,500.0,50.5,New York,1990.0,2.5,ABC,500.0
1,XYZ Inc,200.0,-5.0,Insurance,Jane Smith,NaN,NaN,London,1985.0,5.0,XYZ,NaN
2,PQR Ltd,NaN,NaN,Banking,Alan Brown,120.0,40.0,None,2000.0,1.2,None,300.0
3,123 Corp,150.0,8.0,Investment,Mark Lee,450.0,NaN,Toronto,NaN,3.0,123,NaN
4,Shayan Enterprises,100.0,20.0,Insurance,None,700.0,25.0,Paris,1995.0,1.5,INS,200.0
5,TechCorp,200.0,5.0,NaN,John Doe,500.0,50.5,New York,1990.0,NaN,ABC,500.0
6,LMN Inc,300.0,25.0,Banking,Sarah Davis,NaN,60.0,New York,NaN,4.0,LMN,NaN

In [11]:
fd.info() # Checking the data is cleaned in the Compnay Column

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Company            7 non-null      object
 1   Revenue ($M)       6 non-null      float64
 2   Profit Margin (%)  6 non-null      float64
 3   Industry           6 non-null      object
 4   CEO                6 non-null      object
 5   Employees          5 non-null      float64
 6   Stock Price        5 non-null      float64
 7   HQ City            6 non-null      object
 8   Founded Year       5 non-null      float64
 9   Market Cap ($B)    6 non-null      float64
 10  Ticker Symbol      6 non-null      object
 11  Debt ($M)          4 non-null      float64
dtypes: float64(7), object(5)
memory usage: 804.0+ bytes

### Revenue ($M) Column Cleaning

In [12]:
fd["Revenue ($M)"].isnull().sum() # Cheecking how many missing values are in the Revenue ($M) column

np.int64(1)

In [13]:
fd['Revenue ($M)'].unique()

array([100., 200.,  nan, 150., 300.])

In [14]:
fd['Revenue ($M)'].dtype # Checking type of the data

dtype('float64')

In [15]:
fd['Revenue ($M)'].mean() # Finding mean of the data

np.float64(175.0)

In [16]:
fd['Revenue ($M)'] = fd['Revenue ($M)'].fillna(175.0) # filling the Revenue ($M) column with the mean value of the column

In [17]:
fd

,Company,Revenue ($M),Profit Margin (%),Industry,CEO,Employees,Stock Price,HQ City,Founded Year,Market Cap ($B),Ticker Symbol,Debt ($M)
0,ABC Corp,100.0,10.0,Banking,John Doe,500.0,50.5,New York,1990.0,2.5,ABC,500.0
1,XYZ Inc,200.0,-5.0,Insurance,Jane Smith,NaN,NaN,London,1985.0,5.0,XYZ,NaN
2,PQR Ltd,175.0,NaN,Banking,Alan Brown,120.0,40.0,None,2000.0,1.2,None,300.0
3,123 Corp,150.0,8.0,Investment,Mark Lee,450.0,NaN,Toronto,NaN,3.0,123,NaN
4,Shayan Enterprises,100.0,20.0,Insurance,None,700.0,25.0,Paris,1995.0,1.5,INS,200.0
5,TechCorp,200.0,5.0,NaN,John Doe,500.0,50.5,New York,1990.0,NaN,ABC,500.0
6,LMN Inc,300.0,25.0,Banking,Sarah Davis,NaN,60.0,New York,NaN,4.0,LMN,NaN

In [18]:
fd['Revenue ($M)'].unique()

array([100., 200., 175., 150., 300.])

In [19]:
fd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Company            7 non-null      object
 1   Revenue ($M)       7 non-null      float64
 2   Profit Margin (%)  6 non-null      float64
 3   Industry           6 non-null      object
 4   CEO                6 non-null      object
 5   Employees          5 non-null      float64
 6   Stock Price        5 non-null      float64
 7   HQ City            6 non-null      object
 8   Founded Year       5 non-null      float64
 9   Market Cap ($B)    6 non-null      float64
 10  Ticker Symbol      6 non-null      object
 11  Debt ($M)          4 non-null      float64
dtypes: float64(7), object(5)
memory usage: 804.0+ bytes

### Profit Margin (%) Column Cleaning

In [20]:
fd["Profit Margin (%)"].isnull().sum() # finding the null values in the column

np.int64(1)

In [21]:
fd['Profit Margin (%)'].mean() # finding the mean of the column

np.float64(10.5)

In [22]:
fd['Profit Margin (%)'] = fd['Profit Margin (%)'].fillna(10.5) # filling the null values with the mean of the column

In [23]:
fd

,Company,Revenue ($M),Profit Margin (%),Industry,CEO,Employees,Stock Price,HQ City,Founded Year,Market Cap ($B),Ticker Symbol,Debt ($M)
0,ABC Corp,100.0,10.0,Banking,John Doe,500.0,50.5,New York,1990.0,2.5,ABC,500.0
1,XYZ Inc,200.0,-5.0,Insurance,Jane Smith,NaN,NaN,London,1985.0,5.0,XYZ,NaN
2,PQR Ltd,175.0,10.5,Banking,Alan Brown,120.0,40.0,None,2000.0,1.2,None,300.0
3,123 Corp,150.0,8.0,Investment,Mark Lee,450.0,NaN,Toronto,NaN,3.0,123,NaN
4,Shayan Enterprises,100.0,20.0,Insurance,None,700.0,25.0,Paris,1995.0,1.5,INS,200.0
5,TechCorp,200.0,5.0,NaN,John Doe,500.0,50.5,New York,1990.0,NaN,ABC,500.0
6,LMN Inc,300.0,25.0,Banking,Sarah Davis,NaN,60.0,New York,NaN,4.0,LMN,NaN

In [24]:
fd['Profit Margin (%)'].unique()

array([10. , -5. , 10.5,  8. , 20. ,  5. , 25. ])

In [25]:
fd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Company            7 non-null      object
 1   Revenue ($M)       7 non-null      float64
 2   Profit Margin (%)  7 non-null      float64
 3   Industry           6 non-null      object
 4   CEO                6 non-null      object
 5   Employees          5 non-null      float64
 6   Stock Price        5 non-null      float64
 7   HQ City            6 non-null      object
 8   Founded Year       5 non-null      float64
 9   Market Cap ($B)    6 non-null      float64
 10  Ticker Symbol      6 non-null      object
 11  Debt ($M)          4 non-null      float64
dtypes: float64(7), object(5)
memory usage: 804.0+ bytes

In [26]:
fd

,Company,Revenue ($M),Profit Margin (%),Industry,CEO,Employees,Stock Price,HQ City,Founded Year,Market Cap ($B),Ticker Symbol,Debt ($M)
0,ABC Corp,100.0,10.0,Banking,John Doe,500.0,50.5,New York,1990.0,2.5,ABC,500.0
1,XYZ Inc,200.0,-5.0,Insurance,Jane Smith,NaN,NaN,London,1985.0,5.0,XYZ,NaN
2,PQR Ltd,175.0,10.5,Banking,Alan Brown,120.0,40.0,None,2000.0,1.2,None,300.0
3,123 Corp,150.0,8.0,Investment,Mark Lee,450.0,NaN,Toronto,NaN,3.0,123,NaN
4,Shayan Enterprises,100.0,20.0,Insurance,None,700.0,25.0,Paris,1995.0,1.5,INS,200.0
5,TechCorp,200.0,5.0,NaN,John Doe,500.0,50.5,New York,1990.0,NaN,ABC,500.0
6,LMN Inc,300.0,25.0,Banking,Sarah Davis,NaN,60.0,New York,NaN,4.0,LMN,NaN

### Industry Column Cleaning

In [27]:
fd['Industry'].describe() # finding which value has count , unique, and frequently values

count           6
unique          3
top       Banking
freq            3
Name: Industry, dtype: object

In [28]:
fd["Industry"].isnull().sum() # Checking the null values in the industry column

np.int64(1)

In [29]:
fd['Industry'] = fd['Industry'].fillna("Banking") # filling the nill value with most frequently value

In [30]:
fd

,Company,Revenue ($M),Profit Margin (%),Industry,CEO,Employees,Stock Price,HQ City,Founded Year,Market Cap ($B),Ticker Symbol,Debt ($M)
0,ABC Corp,100.0,10.0,Banking,John Doe,500.0,50.5,New York,1990.0,2.5,ABC,500.0
1,XYZ Inc,200.0,-5.0,Insurance,Jane Smith,NaN,NaN,London,1985.0,5.0,XYZ,NaN
2,PQR Ltd,175.0,10.5,Banking,Alan Brown,120.0,40.0,None,2000.0,1.2,None,300.0
3,123 Corp,150.0,8.0,Investment,Mark Lee,450.0,NaN,Toronto,NaN,3.0,123,NaN
4,Shayan Enterprises,100.0,20.0,Insurance,None,700.0,25.0,Paris,1995.0,1.5,INS,200.0
5,TechCorp,200.0,5.0,Banking,John Doe,500.0,50.5,New York,1990.0,NaN,ABC,500.0
6,LMN Inc,300.0,25.0,Banking,Sarah Davis,NaN,60.0,New York,NaN,4.0,LMN,NaN

In [31]:
fd['Industry'].unique()

array(['Banking', 'Insurance', 'Investment'], dtype=object)

In [32]:
fd['Industry'].info

<bound method Series.info of 0       Banking
1     Insurance
2       Banking
3    Investment
4     Insurance
5       Banking
6       Banking
Name: Industry, dtype: object>

### CEO Column Cleaning

In [33]:
fd["CEO"].isnull().sum() # finding the null values in the column

np.int64(1)

In [34]:
fd['CEO'].info

<bound method Series.info of 0       John Doe
1     Jane Smith
2     Alan Brown
3       Mark Lee
4           None
5       John Doe
6    Sarah Davis
Name: CEO, dtype: object>

In [35]:
fd['CEO']= fd['CEO'].fillna("Unkown") # filling the null value with the unkownn because We Don't know the ceo name

In [36]:
fd

,Company,Revenue ($M),Profit Margin (%),Industry,CEO,Employees,Stock Price,HQ City,Founded Year,Market Cap ($B),Ticker Symbol,Debt ($M)
0,ABC Corp,100.0,10.0,Banking,John Doe,500.0,50.5,New York,1990.0,2.5,ABC,500.0
1,XYZ Inc,200.0,-5.0,Insurance,Jane Smith,NaN,NaN,London,1985.0,5.0,XYZ,NaN
2,PQR Ltd,175.0,10.5,Banking,Alan Brown,120.0,40.0,None,2000.0,1.2,None,300.0
3,123 Corp,150.0,8.0,Investment,Mark Lee,450.0,NaN,Toronto,NaN,3.0,123,NaN
4,Shayan Enterprises,100.0,20.0,Insurance,Unkown,700.0,25.0,Paris,1995.0,1.5,INS,200.0
5,TechCorp,200.0,5.0,Banking,John Doe,500.0,50.5,New York,1990.0,NaN,ABC,500.0
6,LMN Inc,300.0,25.0,Banking,Sarah Davis,NaN,60.0,New York,NaN,4.0,LMN,NaN

In [37]:
fd["CEO"].isnull().sum() # checking again

np.int64(0)

### Employees Column Cleaning

In [38]:
fd['Employees'].isnull().sum() # checking how many null values are in the Employees column

np.int64(2)

In [39]:
fd['Employees'].median # Finding the central tendency median of the Employees column

<bound method Series.median of 0    500.0
1      NaN
2    120.0
3    450.0
4    700.0
5    500.0
6      NaN
Name: Employees, dtype: float64>

In [40]:
fd['Employees'].mean() # finding the central tendency mean of the Employees column

np.float64(454.0)

In [41]:
fd['Employees'] = fd['Employees'].fillna(454.0) # Filling the null values with the mean values of the column

In [42]:
fd

,Company,Revenue ($M),Profit Margin (%),Industry,CEO,Employees,Stock Price,HQ City,Founded Year,Market Cap ($B),Ticker Symbol,Debt ($M)
0,ABC Corp,100.0,10.0,Banking,John Doe,500.0,50.5,New York,1990.0,2.5,ABC,500.0
1,XYZ Inc,200.0,-5.0,Insurance,Jane Smith,454.0,NaN,London,1985.0,5.0,XYZ,NaN
2,PQR Ltd,175.0,10.5,Banking,Alan Brown,120.0,40.0,None,2000.0,1.2,None,300.0
3,123 Corp,150.0,8.0,Investment,Mark Lee,450.0,NaN,Toronto,NaN,3.0,123,NaN
4,Shayan Enterprises,100.0,20.0,Insurance,Unkown,700.0,25.0,Paris,1995.0,1.5,INS,200.0
5,TechCorp,200.0,5.0,Banking,John Doe,500.0,50.5,New York,1990.0,NaN,ABC,500.0
6,LMN Inc,300.0,25.0,Banking,Sarah Davis,454.0,60.0,New York,NaN,4.0,LMN,NaN

In [43]:
fd['Employees'].isnull().sum()

np.int64(0)

### Stock Price Column Cleaning

In [44]:
fd["Stock Price"].isnull().sum() # checking how many null values are in the stock price coulmn

np.int64(2)

In [45]:
fd["Stock Price"].describe() # Numerical Statistics: count, mean, std (standard deviation), min, 25%, 50% (median), 75%, max.
                             # Categorical Statistics: count, unique, top, freq

count     5.000000
mean     45.200000
std      13.325727
min      25.000000
25%      40.000000
50%      50.500000
75%      50.500000
max      60.000000
Name: Stock Price, dtype: float64

In [46]:
fd['Stock Price'].interpolate(method='linear', inplace=True) # using the linear interpolation method

C:\Users\Shayyan\AppData\Local\Temp\ipykernel_7844\4008008977.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  fd['Stock Price'].interpolate(method='linear', inplace=True) # using the linear interpolation method

In [47]:
fd

,Company,Revenue ($M),Profit Margin (%),Industry,CEO,Employees,Stock Price,HQ City,Founded Year,Market Cap ($B),Ticker Symbol,Debt ($M)
0,ABC Corp,100.0,10.0,Banking,John Doe,500.0,50.50,New York,1990.0,2.5,ABC,500.0
1,XYZ Inc,200.0,-5.0,Insurance,Jane Smith,454.0,45.25,London,1985.0,5.0,XYZ,NaN
2,PQR Ltd,175.0,10.5,Banking,Alan Brown,120.0,40.00,None,2000.0,1.2,None,300.0
3,123 Corp,150.0,8.0,Investment,Mark Lee,450.0,32.50,Toronto,NaN,3.0,123,NaN
4,Shayan Enterprises,100.0,20.0,Insurance,Unkown,700.0,25.00,Paris,1995.0,1.5,INS,200.0
5,TechCorp,200.0,5.0,Banking,John Doe,500.0,50.50,New York,1990.0,NaN,ABC,500.0
6,LMN Inc,300.0,25.0,Banking,Sarah Davis,454.0,60.00,New York,NaN,4.0,LMN,NaN

In [48]:
fd['Stock Price'].isnull().sum()# checking again

np.int64(0)

### HQ City Column Cleaning

In [49]:
fd['HQ City'].unique()

array(['New York', 'London', None, 'Toronto', 'Paris'], dtype=object)

In [50]:
fd['HQ City'].dtype

dtype('O')

In [51]:
fd['HQ City'].info

<bound method Series.info of 0    New York
1      London
2        None
3     Toronto
4       Paris
5    New York
6    New York
Name: HQ City, dtype: object>

In [52]:
fd['HQ City'].describe() # Seeing which is the most Frequent Value

count            6
unique           4
top       New York
freq             3
Name: HQ City, dtype: object

In [53]:
fd['HQ City'] = fd['HQ City'].fillna("New York") # Filling the missing value with the most frequent values

In [54]:
fd

,Company,Revenue ($M),Profit Margin (%),Industry,CEO,Employees,Stock Price,HQ City,Founded Year,Market Cap ($B),Ticker Symbol,Debt ($M)
0,ABC Corp,100.0,10.0,Banking,John Doe,500.0,50.50,New York,1990.0,2.5,ABC,500.0
1,XYZ Inc,200.0,-5.0,Insurance,Jane Smith,454.0,45.25,London,1985.0,5.0,XYZ,NaN
2,PQR Ltd,175.0,10.5,Banking,Alan Brown,120.0,40.00,New York,2000.0,1.2,None,300.0
3,123 Corp,150.0,8.0,Investment,Mark Lee,450.0,32.50,Toronto,NaN,3.0,123,NaN
4,Shayan Enterprises,100.0,20.0,Insurance,Unkown,700.0,25.00,Paris,1995.0,1.5,INS,200.0
5,TechCorp,200.0,5.0,Banking,John Doe,500.0,50.50,New York,1990.0,NaN,ABC,500.0
6,LMN Inc,300.0,25.0,Banking,Sarah Davis,454.0,60.00,New York,NaN,4.0,LMN,NaN

In [55]:
fd['HQ City'].isnull().sum() # Checking again

np.int64(0)

### Founded Year Column Cleaning

In [56]:
fd["Founded Year"].unique()

array([1990., 1985., 2000.,   nan, 1995.])

In [57]:
fd["Founded Year"].isnull().sum() # checking how many null values are their in the column

np.int64(2)

In [58]:
fd["Founded Year"].describe()# Numerical Statistics: count, mean, std (standard deviation), min, 25%, 50% (median), 75%, max.
                             # Categorical Statistics: count, unique, top, freq

count       5.000000
mean     1992.000000
std         5.700877
min      1985.000000
25%      1990.000000
50%      1990.000000
75%      1995.000000
max      2000.000000
Name: Founded Year, dtype: float64

In [59]:
fd["Founded Year"] = fd["Founded Year"].fillna(1992.0) # Filling the null values with central tendency mean

In [60]:
fd["Founded Year"]

0    1990.0
1    1985.0
2    2000.0
3    1992.0
4    1995.0
5    1990.0
6    1992.0
Name: Founded Year, dtype: float64

### Market Cap ($B) Column Cleaning

In [61]:
fd["Market Cap ($B)"].describe()

count    6.000000
mean     2.866667
std      1.458310
min      1.200000
25%      1.750000
50%      2.750000
75%      3.750000
max      5.000000
Name: Market Cap ($B), dtype: float64

In [62]:
fd["Market Cap ($B)"].isnull().sum()

np.int64(1)

In [63]:
fd["Market Cap ($B)"] =fd["Market Cap ($B)"].fillna(2.8) #filling the missing values with the central tendency mean

In [64]:
fd["Market Cap ($B)"].isnull().sum()

np.int64(0)

In [65]:
fd

,Company,Revenue ($M),Profit Margin (%),Industry,CEO,Employees,Stock Price,HQ City,Founded Year,Market Cap ($B),Ticker Symbol,Debt ($M)
0,ABC Corp,100.0,10.0,Banking,John Doe,500.0,50.50,New York,1990.0,2.5,ABC,500.0
1,XYZ Inc,200.0,-5.0,Insurance,Jane Smith,454.0,45.25,London,1985.0,5.0,XYZ,NaN
2,PQR Ltd,175.0,10.5,Banking,Alan Brown,120.0,40.00,New York,2000.0,1.2,None,300.0
3,123 Corp,150.0,8.0,Investment,Mark Lee,450.0,32.50,Toronto,1992.0,3.0,123,NaN
4,Shayan Enterprises,100.0,20.0,Insurance,Unkown,700.0,25.00,Paris,1995.0,1.5,INS,200.0
5,TechCorp,200.0,5.0,Banking,John Doe,500.0,50.50,New York,1990.0,2.8,ABC,500.0
6,LMN Inc,300.0,25.0,Banking,Sarah Davis,454.0,60.00,New York,1992.0,4.0,LMN,NaN

### Ticker Symbol Column Cleaning

In [66]:
fd['Ticker Symbol'].dtypes

dtype('O')

In [77]:
fd["Ticker Symbol"].isnull().sum() # Checking how many missing values in that column

np.int64(0)

In [67]:
fd['Ticker Symbol'].unique()

array(['ABC', 'XYZ', None, '123', 'INS', 'LMN'], dtype=object)

In [68]:
fd['Ticker Symbol'] = fd['Ticker Symbol'].fillna("N/A") # fill the nan or missing values in this column by N/A

In [69]:
fd

,Company,Revenue ($M),Profit Margin (%),Industry,CEO,Employees,Stock Price,HQ City,Founded Year,Market Cap ($B),Ticker Symbol,Debt ($M)
0,ABC Corp,100.0,10.0,Banking,John Doe,500.0,50.50,New York,1990.0,2.5,ABC,500.0
1,XYZ Inc,200.0,-5.0,Insurance,Jane Smith,454.0,45.25,London,1985.0,5.0,XYZ,NaN
2,PQR Ltd,175.0,10.5,Banking,Alan Brown,120.0,40.00,New York,2000.0,1.2,N/A,300.0
3,123 Corp,150.0,8.0,Investment,Mark Lee,450.0,32.50,Toronto,1992.0,3.0,123,NaN
4,Shayan Enterprises,100.0,20.0,Insurance,Unkown,700.0,25.00,Paris,1995.0,1.5,INS,200.0
5,TechCorp,200.0,5.0,Banking,John Doe,500.0,50.50,New York,1990.0,2.8,ABC,500.0
6,LMN Inc,300.0,25.0,Banking,Sarah Davis,454.0,60.00,New York,1992.0,4.0,LMN,NaN

### Debt ($M) Column Cleaning

In [70]:
fd['Debt ($M)'].isnull().sum() # Checking how many null values are in the column

np.int64(3)

In [71]:
fd['Debt ($M)'].unique() # seeing unique values in the column

array([500.,  nan, 300., 200.])

In [78]:
fd['Debt ($M)'].mode() # finding the central tendency mode in the column

0    500.0
Name: Debt ($M), dtype: float64

In [73]:
fd['Debt ($M)'] = fd["Debt ($M)"].fillna(500.0 # filling the null values with the mode of the columnn

In [74]:
fd

,Company,Revenue ($M),Profit Margin (%),Industry,CEO,Employees,Stock Price,HQ City,Founded Year,Market Cap ($B),Ticker Symbol,Debt ($M)
0,ABC Corp,100.0,10.0,Banking,John Doe,500.0,50.50,New York,1990.0,2.5,ABC,500.0
1,XYZ Inc,200.0,-5.0,Insurance,Jane Smith,454.0,45.25,London,1985.0,5.0,XYZ,500.0
2,PQR Ltd,175.0,10.5,Banking,Alan Brown,120.0,40.00,New York,2000.0,1.2,N/A,300.0
3,123 Corp,150.0,8.0,Investment,Mark Lee,450.0,32.50,Toronto,1992.0,3.0,123,500.0
4,Shayan Enterprises,100.0,20.0,Insurance,Unkown,700.0,25.00,Paris,1995.0,1.5,INS,200.0
5,TechCorp,200.0,5.0,Banking,John Doe,500.0,50.50,New York,1990.0,2.8,ABC,500.0
6,LMN Inc,300.0,25.0,Banking,Sarah Davis,454.0,60.00,New York,1992.0,4.0,LMN,500.0

In [75]:
fd.to_csv("Clean Data.csv",index = False) # Converting the data frane in to csv this is the clean data

In [76]:
df.to_csv("Dirty Data.csv",index = False) # Converting other data frame in to csv which is the dirty data or data that given us to clean